Tekla Open API Reference for Tekla Structures 2025
LayoutAttributes Constructor (String)
Note: This API is now obsolete.
 Creates a new layout attributes instance that loads drawing layout attributes from the specified attribute file.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("This constructor is obsolete and may be removed in the future. Instead, use the constructor which takes a Drawing Type.",
	false)]
public LayoutAttributes(
	string AttributeFile
)
<ObsoleteAttribute("This constructor is obsolete and may be removed in the future. Instead, use the constructor which takes a Drawing Type.",
	false)>
Public Sub New (
	AttributeFile As String
)
Parameters
AttributeFile
Type: System.String
The name of the drawing attribute file. E.g. "standard".
See Also
Reference
LayoutAttributes Class
LayoutAttributes Overload
Tekla.Structures.Drawing Namespace